[Killed] ArrayDeclaration
main/components/Attractions/AttractionTable.js:32:21
         navigate(`/attractions/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
