[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:84:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
-                    <NavDropdown.Item href="/attractions/" data-testid="appnavbar-attractions-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown">
+                    <NavDropdown.Item href="/attractions/" data-testid="appnavbar-attractions-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the attractions menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-attractions-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:84:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
-                    <NavDropdown.Item href="/attractions/" data-testid="appnavbar-attractions-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the attractions menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-attractions-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:88:23
                   <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
                     <NavDropdown.Item href="/attractions/" data-testid="appnavbar-attractions-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the attractions menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-attractions-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:88:23
                   <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
                     <NavDropdown.Item href="/attractions/" data-testid="appnavbar-attractions-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/attractions/create" data-testid="appnavbar-attractions-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the attractions menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-attractions-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
