[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:79:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Transports" id="appnavbar-transport-dropdown" data-testid="appnavbar-transport-dropdown" >
-                    <NavDropdown.Item href="/transport/">List Transportation</NavDropdown.Item>
-                    <NavDropdown.Item href="/transport/create">Create Transportation</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Transports" id="appnavbar-transport-dropdown" data-testid="appnavbar-transport-dropdown">
+                    <NavDropdown.Item href="/transport/">List Transportation</NavDropdown.Item>
+                    <NavDropdown.Item href="/transport/create">Create Transportation</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the transport menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-transport-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:79:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Transports" id="appnavbar-transport-dropdown" data-testid="appnavbar-transport-dropdown" >
-                    <NavDropdown.Item href="/transport/">List Transportation</NavDropdown.Item>
-                    <NavDropdown.Item href="/transport/create">Create Transportation</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the transport menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-transport-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
