[Killed] BlockStatement
main/components/Attractions/AttractionTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    attractionUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function AttractionTable({
killedBy: AttractionTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:10:17
 
 
 const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
+    console.log(``);
     attractionUtils.del(cell.row.values.id);
 }
killedBy: AttractionTable tests Delete button calls delete callback
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "deleteCallback: {\"id\":2,\"name\":\"Empire State Building\",\"description\":\"102-story Art Deco skyscraper in Midtown Manhattan\",\"address\":\"20 W 34th St., New York, NY 10001\"})"
Received string:    ""

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:18:20
     attractions,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "AttractionTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AttractionTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Attractions/AttractionTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/attractions/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: AttractionTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/attractions/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:24:18
  
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/attractions/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: AttractionTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/attractions/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Attractions/AttractionTable.js:27:39
         navigate(`/attractions/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/attractions/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: AttractionTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/attractions/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Attractions/AttractionTable.js:32:21
         navigate(`/attractions/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        },
-        {
-            Header: 'Address',
-            accessor: 'address',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:39:21
         },
 
         {
-            Header: 'Name',
+            Header: "",
             accessor: 'name',
         },
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:40:23
 
         {
             Header: 'Name',
-            accessor: 'name',
+            accessor: "",
         },
         {
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AttractionTable-cell-row-0-col-name"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:44:23
         },
         {
             Header: 'Description',
-            accessor: 'description',
+            accessor: "",
         },
         {
killedBy: AttractionTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AttractionTable-cell-row-0-col-description"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Attractions/AttractionTable.js:46:9
             Header: 'Description',
             accessor: 'description',
         },
-        {
-            Header: 'Address',
-            accessor: 'address',
-        }
+        {}
     ];
 
killedBy: AttractionTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:55:22
     const buttonColumns = [
         ...columns,
         ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
-        ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
+        ButtonColumn("", "primary", editCallback, testIdPrefix),
         ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
     ]
killedBy: AttractionTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Attractions/AttractionTable.js:56:22
         ...columns,
         ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
         ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
-        ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
+        ButtonColumn("", "danger", deleteCallback, testIdPrefix),
     ]
 
killedBy: AttractionTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
