[Killed] BlockStatement
main/pages/Attractions/AttractionCreatePage.js:6:48
 import { useNavigate } from 'react-router-dom'
 import { attractionUtils } from 'main/utils/attractionUtils';
 
-export default function AttractionCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (attraction) => {
-    const createdAttraction = attractionUtils.add(attraction);
-    console.log("createdAttraction: " + JSON.stringify(createdAttraction));
-    navigate("/attractions");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Attraction</h1>
-        <AttractionForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function AttractionCreatePage() {}
 
killedBy: AttractionCreatePage tests renders without crashing
statusReason: Error: AttractionCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Attractions/AttractionCreatePage.js:10:42
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (attraction) => {
-    const createdAttraction = attractionUtils.add(attraction);
-    console.log("createdAttraction: " + JSON.stringify(createdAttraction));
-    navigate("/attractions");
-  }  
+  const onSubmit = async (attraction) => {}  
 
   return (
killedBy: AttractionCreatePage tests redirects to /attractions on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
