[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
-                    <NavDropdown.Item href="/attractions/">List Attractions</NavDropdown.Item>
-                    <NavDropdown.Item href="/attractions/create">Create Attraction</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the attractions menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-attractions-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown" >
-                    <NavDropdown.Item href="/attractions/">List Attractions</NavDropdown.Item>
-                    <NavDropdown.Item href="/attractions/create">Create Attraction</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Attractions" id="appnavbar-attractions-dropdown" data-testid="appnavbar-attractions-dropdown">
+                    <NavDropdown.Item href="/attractions/">List Attractions</NavDropdown.Item>
+                    <NavDropdown.Item href="/attractions/create">Create Attraction</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the attractions menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-attractions-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:79:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown" >
-                    <NavDropdown.Item href="/restaurants/">List Restaurants</NavDropdown.Item>
-                    <NavDropdown.Item href="/restaurants/create">Create Restaurant</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
+                    <NavDropdown.Item href="/restaurants/">List Restaurants</NavDropdown.Item>
+                    <NavDropdown.Item href="/restaurants/create">Create Restaurant</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:79:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown" >
-                    <NavDropdown.Item href="/restaurants/">List Restaurants</NavDropdown.Item>
-                    <NavDropdown.Item href="/restaurants/create">Create Restaurant</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:90:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown" >
-                    <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the ucsbdates menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-ucsbdates-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:94:23
                   <NavDropdown title="UCSBDates" id="appnavbar-ucsbdates-dropdown" data-testid="appnavbar-ucsbdates-dropdown" >
                     <NavDropdown.Item href="/ucsbdates/list" data-testid="appnavbar-ucsbdates-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/ucsbdates/create" data-testid="appnavbar-ucsbdates-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the ucsbdates menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ucsbdates-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
