[Killed] BlockStatement
main/pages/Attractions/AttractionDetailsPage.js:6:49
 import AttractionTable from 'main/components/Attractions/AttractionTable';
 import { attractionUtils } from 'main/utils/attractionUtils';
 
-export default function AttractionDetailsPage() {
-  let { id } = useParams();
-
-  const response = attractionUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Attraction Details</h1>
-        <AttractionTable attractions={[response.attraction]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function AttractionDetailsPage() {}
 
killedBy: AttractionDetailsPage tests renders without crashing
statusReason: Error: AttractionDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Attractions/AttractionDetailsPage.js:15:75
     <BasicLayout>
       <div className="pt-2">
         <h1>Attraction Details</h1>
-        <AttractionTable attractions={[response.attraction]} showButtons={false} />
+        <AttractionTable attractions={[response.attraction]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: AttractionDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="AttractionTable-header-Delete"
  role="columnheader"
