[Killed] BlockStatement
main/pages/Attractions/AttractionIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`AttractionIndexPage deleteCallback: ${showCell(cell)})`);
-        attractionUtils.del(cell.row.values.id);
-        navigate("/attractions");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: AttractionIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Attractions/AttractionIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`AttractionIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         attractionUtils.del(cell.row.values.id);
         navigate("/attractions");
killedBy: AttractionIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "AttractionIndexPage deleteCallback: {\"id\":3,\"name\":\"Freebirds\",\"description\":\"Burrito joint, and iconic Isla Vista location\",\"address\":\"879 Embarcadero del Norte\"}"
Received string:    ""
