[Killed] BlockStatement
src/main/utils/attractionUtils.js:2:19
 // get attractions from local storage
-const get = () => {
-  const attractionValue = localStorage.getItem("attractions");
-  if (attractionValue === undefined) {
-      const attractionCollection = { nextId: 1, attractions: [] }
-      return set(attractionCollection);
-  }
-  const attractionCollection = JSON.parse(attractionValue);
-  if (attractionCollection === null) {
-      const attractionCollection = { nextId: 1, attractions: [] }
-      return set(attractionCollection);
-  }
-  return attractionCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: AttractionTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'attractions')

[Killed] StringLiteral
src/main/utils/attractionUtils.js:3:48
 // get attractions from local storage
 const get = () => {
-  const attractionValue = localStorage.getItem("attractions");
+  const attractionValue = localStorage.getItem("");
   if (attractionValue === undefined) {
       const attractionCollection = { nextId: 1, attractions: [] }
killedBy: attractionUtils tests get When attractions is undefined in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:4:7
 // get attractions from local storage
 const get = () => {
   const attractionValue = localStorage.getItem("attractions");
-  if (attractionValue === undefined) {
+  if (false) {
       const attractionCollection = { nextId: 1, attractions: [] }
       return set(attractionCollection);
killedBy: attractionUtils tests get When attractions is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
src/main/utils/attractionUtils.js:4:38
 // get attractions from local storage
 const get = () => {
   const attractionValue = localStorage.getItem("attractions");
-  if (attractionValue === undefined) {
-      const attractionCollection = { nextId: 1, attractions: [] }
-      return set(attractionCollection);
-  }
+  if (attractionValue === undefined) {}
   const attractionCollection = JSON.parse(attractionValue);
   if (attractionCollection === null) {
killedBy: attractionUtils tests get When attractions is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
src/main/utils/attractionUtils.js:9:38
       return set(attractionCollection);
   }
   const attractionCollection = JSON.parse(attractionValue);
-  if (attractionCollection === null) {
-      const attractionCollection = { nextId: 1, attractions: [] }
-      return set(attractionCollection);
-  }
+  if (attractionCollection === null) {}
   return attractionCollection;
 };
killedBy: AttractionTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'attractions')

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:9:7
       return set(attractionCollection);
   }
   const attractionCollection = JSON.parse(attractionValue);
-  if (attractionCollection === null) {
+  if (false) {
       const attractionCollection = { nextId: 1, attractions: [] }
       return set(attractionCollection);
killedBy: attractionUtils tests get When attractions is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"attractions": [], "nextId": 1}
Received: null

[Killed] ArrayDeclaration
src/main/utils/attractionUtils.js:10:62
   }
   const attractionCollection = JSON.parse(attractionValue);
   if (attractionCollection === null) {
-      const attractionCollection = { nextId: 1, attractions: [] }
+      const attractionCollection = { nextId: 1, attractions: ["Stryker was here"] }
       return set(attractionCollection);
   }
killedBy: attractionUtils tests get When attractions is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "attractions": Array [],
+   "attractions": Array [

[Killed] BlockStatement
src/main/utils/attractionUtils.js:16:25
   return attractionCollection;
 };
 
-const getById = (id) => {
-  if (id === undefined) {
-      return { "error": "id is a required parameter" };
-  }
-  const attractionCollection = get();
-  const attractions = attractionCollection.attractions;
-
-  /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
-  if (index === -1) {
-      return { "error": `attraction with id ${id} not found` };
-  }
-  return { attraction: attractions[index] };
-}
+const getById = (id) => {}
 
 // set attractions in local storage
killedBy: attractionUtils tests getById Check that getting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"attraction": {"address": "3601 Lyon St, San Francisco, CA 94123", "description": "Monumental structure located in the Marina District of San Francisco, built for for the 1915 Panama–Pacific International Exposition", "id": 3, "name": "Palace of Fine Arts"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:17:7
 };
 
 const getById = (id) => {
-  if (id === undefined) {
+  if (true) {
       return { "error": "id is a required parameter" };
   }
killedBy: attractionUtils tests getById Check that getting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "attraction": Object {
-     "address": "3601 Lyon St, San Francisco, CA 94123",

[Killed] EqualityOperator
src/main/utils/attractionUtils.js:24:46
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
+  const index = attractions.findIndex((r) => r.id != id);
   if (index === -1) {
       return { "error": `attraction with id ${id} not found` };
killedBy: attractionUtils tests getById Check that getting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "attraction": Object {
-     "address": "3601 Lyon St, San Francisco, CA 94123",

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:24:46
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
+  const index = attractions.findIndex((r) => true);
   if (index === -1) {
       return { "error": `attraction with id ${id} not found` };
killedBy: attractionUtils tests getById Check that getting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "attraction": Object {
-     "address": "3601 Lyon St, San Francisco, CA 94123",

[Killed] EqualityOperator
src/main/utils/attractionUtils.js:25:7
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == id);
-  if (index === -1) {
+  if (index !== -1) {
       return { "error": `attraction with id ${id} not found` };
   }
killedBy: attractionUtils tests getById Check that getting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "attraction": Object {
-     "address": "3601 Lyon St, San Francisco, CA 94123",

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:25:7
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == id);
-  if (index === -1) {
+  if (false) {
       return { "error": `attraction with id ${id} not found` };
   }
killedBy: attractionUtils tests getById Check that getting a non-existing attraction returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "attraction with id 99 not found",
+   "attraction": undefined,

[Killed] BlockStatement
src/main/utils/attractionUtils.js:32:39
 }
 
 // set attractions in local storage
-const set = (attractionCollection) => {
-  localStorage.setItem("attractions", JSON.stringify(attractionCollection));
-  return attractionCollection;
-};
+const set = (attractionCollection) => {};
 
 // add a attraction to local storage
killedBy: attractionUtils tests get When attractions is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"attractions": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/attractionUtils.js:33:24
 
 // set attractions in local storage
 const set = (attractionCollection) => {
-  localStorage.setItem("attractions", JSON.stringify(attractionCollection));
+  localStorage.setItem("", JSON.stringify(attractionCollection));
   return attractionCollection;
 };
killedBy: attractionUtils tests get When attractions is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "attractions", "{\"nextId\":1,\"attractions\":[]}"
Received: "", "{\"nextId\":1,\"attractions\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/attractionUtils.js:38:29
 };
 
 // add a attraction to local storage
-const add = (attraction) => {
-  const attractionCollection = get();
-  attraction = { ...attraction, id: attractionCollection.nextId };
-  attractionCollection.nextId++;
-  attractionCollection.attractions.push(attraction);
-  set(attractionCollection);
-  return attraction;
-};
+const add = (attraction) => {};
 
 // update a attraction in local storage
killedBy: attractionUtils tests add Starting from [], check that adding one attraction works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "Golden Gate Bridge, San Francisco, CA", "description": "Iconic red bridge in San Francisco", "id": 1, "name": "Golden Gate Bridge"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/attractionUtils.js:41:3
 const add = (attraction) => {
   const attractionCollection = get();
   attraction = { ...attraction, id: attractionCollection.nextId };
-  attractionCollection.nextId++;
+  attractionCollection.nextId--;
   attractionCollection.attractions.push(attraction);
   set(attractionCollection);
killedBy: attractionUtils tests add Starting from [], check that adding one attraction works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "attractions", "{\"nextId\":2,\"attractions\":[{\"id\":1,\"name\":\"Golden Gate Bridge\",\"address\":\"Golden Gate Bridge, San Francisco, CA\",\"description\":\"Iconic red bridge in San Francisco\"}]}"
Received: "attractions", "{\"nextId\":0,\"attractions\":[{\"id\":1,\"name\":\"Golden Gate Bridge\",\"address\":\"Golden Gate Bri

[Killed] BlockStatement
src/main/utils/attractionUtils.js:48:32
 };
 
 // update a attraction in local storage
-const update = (attraction) => {
-  const attractionCollection = get();
-
-  const attractions = attractionCollection.attractions;
-
-  /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == attraction.id);
-  if (index === -1) {
-      return { "error": `attraction with id ${attraction.id} not found` };
-  }
-  attractions[index] = attraction;
-  set(attractionCollection);
-  return { attractionCollection: attractionCollection };
-};
+const update = (attraction) => {};
 
 // delete a attraction from local storage
killedBy: attractionUtils tests update Check that updating an existing attraction works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/attractionUtils.js:54:46
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == attraction.id);
+  const index = attractions.findIndex((r) => r.id != attraction.id);
   if (index === -1) {
       return { "error": `attraction with id ${attraction.id} not found` };
killedBy: attractionUtils tests update Check that updating an existing attraction works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -3,17 +3,17 @@
      "attractions": Array [
        Object {

[Killed] ArrowFunction
src/main/utils/attractionUtils.js:54:39
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == attraction.id);
+  const index = attractions.findIndex(() => undefined);
   if (index === -1) {
       return { "error": `attraction with id ${attraction.id} not found` };
killedBy: attractionUtils tests update Check that updating an existing attraction works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "attractionCollection": Object {
-     "attractions": Array [

[Killed] BlockStatement
src/main/utils/attractionUtils.js:55:21
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == attraction.id);
-  if (index === -1) {
-      return { "error": `attraction with id ${attraction.id} not found` };
-  }
+  if (index === -1) {}
   attractions[index] = attraction;
   set(attractionCollection);
killedBy: attractionUtils tests update Check that updating an non-existing attraction returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "attraction with id 99 not found",
+   "attractionCollection": Object {

[Killed] UnaryOperator
src/main/utils/attractionUtils.js:55:17
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == attraction.id);
-  if (index === -1) {
+  if (index === +1) {
       return { "error": `attraction with id ${attraction.id} not found` };
   }
killedBy: attractionUtils tests update Check that updating an non-existing attraction returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "attraction with id 99 not found",
+   "attractionCollection": Object {

[Killed] ObjectLiteral
src/main/utils/attractionUtils.js:56:14
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == attraction.id);
   if (index === -1) {
-      return { "error": `attraction with id ${attraction.id} not found` };
+      return {};
   }
   attractions[index] = attraction;
killedBy: attractionUtils tests update Check that updating an non-existing attraction returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "attraction with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/attractionUtils.js:60:10
   }
   attractions[index] = attraction;
   set(attractionCollection);
-  return { attractionCollection: attractionCollection };
+  return {};
 };
 
killedBy: attractionUtils tests update Check that updating an existing attraction works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Object {
-   "attractionCollection": Object {
-     "attractions": Array [

[Killed] BlockStatement
src/main/utils/attractionUtils.js:64:21
 };
 
 // delete a attraction from local storage
-const del = (id) => {
-  if (id === undefined) {
-      return { "error": "id is a required parameter" };
-  }
-  const attractionCollection = get();
-  const attractions = attractionCollection.attractions;
-
-  /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
-  if (index === -1) {
-      return { "error": `attraction with id ${id} not found` };
-  }
-  attractions.splice(index, 1);
-  set(attractionCollection);
-  return { attractionCollection: attractionCollection };
-};
+const del = (id) => {};
 
 const attractionUtils = {
killedBy: attractionUtils tests del Check that deleting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:65:7
 
 // delete a attraction from local storage
 const del = (id) => {
-  if (id === undefined) {
+  if (false) {
       return { "error": "id is a required parameter" };
   }
killedBy: attractionUtils tests del Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "attraction with id undefined not found",

[Killed] ObjectLiteral
src/main/utils/attractionUtils.js:66:14
 // delete a attraction from local storage
 const del = (id) => {
   if (id === undefined) {
-      return { "error": "id is a required parameter" };
+      return {};
   }
   const attractionCollection = get();
killedBy: attractionUtils tests del Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "id is a required parameter",
- }

[Killed] ArrowFunction
src/main/utils/attractionUtils.js:72:39
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
+  const index = attractions.findIndex(() => undefined);
   if (index === -1) {
       return { "error": `attraction with id ${id} not found` };
killedBy: attractionUtils tests del Check that deleting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "attractionCollection": Object {
-     "attractions": Array [

[Killed] ConditionalExpression
src/main/utils/attractionUtils.js:72:46
   const attractions = attractionCollection.attractions;
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-  const index = attractions.findIndex((r) => r.id == id);
+  const index = attractions.findIndex((r) => false);
   if (index === -1) {
       return { "error": `attraction with id ${id} not found` };
killedBy: attractionUtils tests del Check that deleting a attraction by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "attractionCollection": Object {
-     "attractions": Array [

[Killed] BlockStatement
src/main/utils/attractionUtils.js:73:21
 
   /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
   const index = attractions.findIndex((r) => r.id == id);
-  if (index === -1) {
-      return { "error": `attraction with id ${id} not found` };
-  }
+  if (index === -1) {}
   attractions.splice(index, 1);
   set(attractionCollection);
killedBy: attractionUtils tests del Check that deleting a non-existing attraction returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "attraction with id 99 not found",
+   "attractionCollection": Object {
