[Killed] BlockStatement
main/components/Transports/TransportTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    transportUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function TransportTable({
killedBy: TransportTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Transports/TransportTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/transports/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: TransportTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/transports/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Transports/TransportTable.js:27:39
         navigate(`/transports/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/transports/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: TransportTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/transports/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Transports/TransportTable.js:43:21
             accessor: 'name',
         },
         {
-            Header: 'Mode',
+            Header: "",
             accessor: 'mode',
         },
killedBy: TransportTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Mode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Transports/TransportTable.js:48:23
         },
         {
             Header: 'Cost',
-            accessor: 'cost',
+            accessor: "",
         }
     ];
killedBy: TransportDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
