[Killed] BlockStatement
main/pages/Transports/TransportCreatePage.js:6:47
 import { useNavigate } from 'react-router-dom'
 import { transportUtils } from 'main/utils/transportUtils';
 
-export default function TransportCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (transport) => {
-    const createdTransport = transportUtils.add(transport);
-    console.log("createdTransport: " + JSON.stringify(createdTransport));
-    navigate("/transports");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Transport</h1>
-        <TransportForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function TransportCreatePage() {}
 
killedBy: TransportCreatePage tests renders without crashing
statusReason: Error: TransportCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Transports/TransportCreatePage.js:10:41
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (transport) => {
-    const createdTransport = transportUtils.add(transport);
-    console.log("createdTransport: " + JSON.stringify(createdTransport));
-    navigate("/transports");
-  }  
+  const onSubmit = async (transport) => {}  
 
   return (
killedBy: TransportCreatePage tests redirects to /transports on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
