[Killed] BlockStatement
main/pages/Transports/TransportDetailsPage.js:6:48
 import TransportTable from 'main/components/Transports/TransportTable';
 import { transportUtils } from 'main/utils/transportUtils';
 
-export default function TransportDetailsPage() {
-  let { id } = useParams();
-
-  const response = transportUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Transport Details</h1>
-        <TransportTable transports={[response.transport]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function TransportDetailsPage() {}
 
killedBy: TransportDetailsPage tests renders without crashing
statusReason: Error: TransportDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Transports/TransportDetailsPage.js:15:72
     <BasicLayout>
       <div className="pt-2">
         <h1>Transport Details</h1>
-        <TransportTable transports={[response.transport]} showButtons={false} />
+        <TransportTable transports={[response.transport]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: TransportDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="TransportTable-header-Delete"
  role="columnheader"
