[Killed] BlockStatement
main/pages/Transports/TransportEditPage.js:9:45
 import { useNavigate } from 'react-router-dom'
 
 
-export default function TransportEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = transportUtils.getById(id);
-
-    const onSubmit = async (transport) => {
-        const updatedTransport = transportUtils.update(transport);
-        console.log("updatedTransport: " + JSON.stringify(updatedTransport));
-        navigate("/transports");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Transport</h1>
-                <TransportForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.transport}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function TransportEditPage() {}
killedBy: TransportEditPage tests renders without crashing
statusReason: Error: TransportEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Transports/TransportEditPage.js:16:43
 
     const response = transportUtils.getById(id);
 
-    const onSubmit = async (transport) => {
-        const updatedTransport = transportUtils.update(transport);
-        console.log("updatedTransport: " + JSON.stringify(updatedTransport));
-        navigate("/transports");
-    }  
+    const onSubmit = async (transport) => {}  
 
     return (
killedBy: TransportEditPage tests redirects to /transports on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
