[Killed] BlockStatement
main/pages/Transports/TransportIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`TransportIndexPage deleteCallback: ${showCell(cell)})`);
-        transportUtils.del(cell.row.values.id);
-        navigate("/transports");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: TransportIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Transports/TransportIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`TransportIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         transportUtils.del(cell.row.values.id);
         navigate("/transports");
killedBy: TransportIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "TransportIndexPage deleteCallback: {\"id\":3,\"name\":\"Mr. Scooty\",\"mode\":\"Kart\",\"cost\":\"1000\"}"
Received string:    ""
