[Killed] BlockStatement
src/main/utils/transportUtils.js:2:19
 // get transportation services from local storage
-const get = () => {
-    const transportValue = localStorage.getItem("transport");
-    if (transportValue === undefined) {
-        const transportCollection = { nextId: 1, transports: [] }
-        return set(transportCollection);
-    }
-    const transportCollection = JSON.parse(transportValue);
-    if (transportCollection === null) {
-        const transportCollection = { nextId: 1, transports: [] }
-        return set(transportCollection);
-    }
-    return transportCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: TransportTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'transports')

[Killed] BlockStatement
src/main/utils/transportUtils.js:4:39
 // get transportation services from local storage
 const get = () => {
     const transportValue = localStorage.getItem("transport");
-    if (transportValue === undefined) {
-        const transportCollection = { nextId: 1, transports: [] }
-        return set(transportCollection);
-    }
+    if (transportValue === undefined) {}
     const transportCollection = JSON.parse(transportValue);
     if (transportCollection === null) {
killedBy: transportUtils tests get When transport is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] EqualityOperator
src/main/utils/transportUtils.js:4:9
 // get transportation services from local storage
 const get = () => {
     const transportValue = localStorage.getItem("transport");
-    if (transportValue === undefined) {
+    if (transportValue !== undefined) {
         const transportCollection = { nextId: 1, transports: [] }
         return set(transportCollection);
killedBy: transportUtils tests get When transport is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/transportUtils.js:9:9
         return set(transportCollection);
     }
     const transportCollection = JSON.parse(transportValue);
-    if (transportCollection === null) {
+    if (false) {
         const transportCollection = { nextId: 1, transports: [] }
         return set(transportCollection);
killedBy: transportUtils tests get When transport is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "transports": []}
Received: null

[Killed] EqualityOperator
src/main/utils/transportUtils.js:9:9
         return set(transportCollection);
     }
     const transportCollection = JSON.parse(transportValue);
-    if (transportCollection === null) {
+    if (transportCollection !== null) {
         const transportCollection = { nextId: 1, transports: [] }
         return set(transportCollection);
killedBy: transportUtils tests get When transport is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "transports": []}
Received: null

[Killed] ArrayDeclaration
src/main/utils/transportUtils.js:10:62
     }
     const transportCollection = JSON.parse(transportValue);
     if (transportCollection === null) {
-        const transportCollection = { nextId: 1, transports: [] }
+        const transportCollection = { nextId: 1, transports: ["Stryker was here"] }
         return set(transportCollection);
     }
killedBy: transportUtils tests get When transport is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "transports": Array [],

[Killed] BlockStatement
src/main/utils/transportUtils.js:16:25
     return transportCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const transportCollection = get();
-    const transports = transportCollection.transports;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `transportation service with id ${id} not found` };
-    }
-    return { transport: transports[index] };
-}
+const getById = (id) => {}
 
 // set transportation services in local storage
killedBy: transportUtils tests getById Check that getting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"transport": {"cost": "10000", "id": 3, "mode": "kart", "name": "Inkstriker"}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/transportUtils.js:24:40
     const transports = transportCollection.transports;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == id);
+    const index = transports.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `transportation service with id ${id} not found` };
killedBy: transportUtils tests getById Check that getting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "transport": Object {
-     "cost": "10000",

[Killed] EqualityOperator
src/main/utils/transportUtils.js:24:47
     const transports = transportCollection.transports;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == id);
+    const index = transports.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `transportation service with id ${id} not found` };
killedBy: transportUtils tests getById Check that getting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "transport": Object {
-     "cost": "10000",

[Killed] BlockStatement
src/main/utils/transportUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `transportation service with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { transport: transports[index] };
 }
killedBy: transportUtils tests getById Check that getting a non-existant transportation service returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "transportation service with id 99 not found",
+   "transport": undefined,

[Killed] EqualityOperator
src/main/utils/transportUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `transportation service with id ${id} not found` };
     }
killedBy: transportUtils tests getById Check that getting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "transport": Object {
-     "cost": "10000",

[Killed] BlockStatement
src/main/utils/transportUtils.js:32:38
 }
 
 // set transportation services in local storage
-const set = (transportCollection) => {
-    localStorage.setItem("transport", JSON.stringify(transportCollection));
-    return transportCollection;
-};
+const set = (transportCollection) => {};
 
 // add a transportation service to local storage
killedBy: transportUtils tests get When transport is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "transports": []}
Received: undefined

[Killed] BlockStatement
src/main/utils/transportUtils.js:38:28
 };
 
 // add a transportation service to local storage
-const add = (transport) => {
-    const transportCollection = get();
-    transport = { ...transport, id: transportCollection.nextId++ };
-    transportCollection.transports.push(transport);
-    set(transportCollection);
-    return transport;
-};
+const add = (transport) => {};
 
 // update a transportation service in local storage
killedBy: transportUtils tests add Starting from [], check that adding one transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cost": "100", "id": 1, "mode": "kart", "name": "Standard Kart"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/transportUtils.js:40:37
 // add a transportation service to local storage
 const add = (transport) => {
     const transportCollection = get();
-    transport = { ...transport, id: transportCollection.nextId++ };
+    transport = { ...transport, id: transportCollection.nextId-- };
     transportCollection.transports.push(transport);
     set(transportCollection);
killedBy: transportUtils tests add Starting from [], check that adding one transportation service works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "transport", "{\"nextId\":2,\"transports\":[{\"id\":1,\"name\":\"Standard Kart\",\"mode\":\"kart\",\"cost\":\"100\"}]}"
Received: "transport", "{\"nextId\":0,\"transports\":[{\"id\":1,\"name\":\"Standard Kart\",\"mode\":\"kart\",\"cost\":\"100\"}]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/transportUtils.js:47:31
 };
 
 // update a transportation service in local storage
-const update = (transport) => {
-    const transportCollection = get();
-
-    const transports = transportCollection.transports;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == transport.id);
-    if (index === -1) {
-        return { "error": `transportation service with id ${transport.id} not found` };
-    }
-    transports[index] = transport;
-    set(transportCollection);
-    return { transportCollection: transportCollection };
-};
+const update = (transport) => {};
 
 // delete a transportation service from local storage
killedBy: transportUtils tests update Check that updating an existing transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"transportCollection": {"nextId": 5, "transports": [{"cost": "1000", "id": 2, "mode": "kart", "name": "Updated Name"}, {"cost": "10000", "id": 3, "mode": "kart", "name": "Inkstriker"}, {"cost": "100000", "id": 4, "mode": "scooter", "name": "Mr. Scooty"}]}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/transportUtils.js:53:40
     const transports = transportCollection.transports;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == transport.id);
+    const index = transports.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `transportation service with id ${transport.id} not found` };
killedBy: transportUtils tests update Check that updating an existing transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "transportCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/transportUtils.js:53:47
     const transports = transportCollection.transports;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == transport.id);
+    const index = transports.findIndex((r) => false);
     if (index === -1) {
         return { "error": `transportation service with id ${transport.id} not found` };
killedBy: transportUtils tests update Check that updating an existing transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "transportCollection": Object {
-     "nextId": 5,

[Killed] EqualityOperator
src/main/utils/transportUtils.js:54:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == transport.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `transportation service with id ${transport.id} not found` };
     }
killedBy: transportUtils tests update Check that updating an existing transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "transportCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/transportUtils.js:54:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == transport.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `transportation service with id ${transport.id} not found` };
     }
killedBy: transportUtils tests update Check that updating an existing transportation service works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "transportCollection": Object {
-     "nextId": 5,

[Killed] ObjectLiteral
src/main/utils/transportUtils.js:55:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == transport.id);
     if (index === -1) {
-        return { "error": `transportation service with id ${transport.id} not found` };
+        return {};
     }
     transports[index] = transport;
killedBy: transportUtils tests update Check that updating an non-existing transportation service returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "transportation service with id 99 not found",
- }

[Killed] BlockStatement
src/main/utils/transportUtils.js:63:21
 };
 
 // delete a transportation service from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const transportCollection = get();
-    const transports = transportCollection.transports;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `transportation service with id ${id} not found` };
-    }
-    transports.splice(index, 1);
-    set(transportCollection);
-    return { transportCollection: transportCollection };
-};
+const del = (id) => {};
 
 const transportUtils = {
killedBy: transportUtils tests del Check that deleting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"transportCollection": {"nextId": 5, "transports": [{"cost": "1000", "id": 2, "mode": "kart", "name": "Biddybuggy"}, {"cost": "100000", "id": 4, "mode": "scooter", "name": "Mr. Scooty"}]}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/transportUtils.js:72:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `transportation service with id ${id} not found` };
     }
killedBy: transportUtils tests del Check that deleting a non-existing transportation service returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "transportation service with id 99 not found",
+   "transportCollection": Object {

[Killed] UnaryOperator
src/main/utils/transportUtils.js:72:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `transportation service with id ${id} not found` };
     }
killedBy: transportUtils tests del Check that deleting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "transportCollection": Object {
-     "nextId": 5,

[Killed] StringLiteral
src/main/utils/transportUtils.js:73:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = transports.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `transportation service with id ${id} not found` };
+        return { "error": `` };
     }
     transports.splice(index, 1);
killedBy: transportUtils tests del Check that deleting a non-existing transportation service returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "transportation service with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/transportUtils.js:77:12
     }
     transports.splice(index, 1);
     set(transportCollection);
-    return { transportCollection: transportCollection };
+    return {};
 };
 
killedBy: transportUtils tests del Check that deleting a transportation service by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

- Object {
-   "transportCollection": Object {
-     "nextId": 5,
