[Killed] BlockStatement
main/pages/Attractions/AttractionEditPage.js:9:46
 import { useNavigate } from 'react-router-dom'
 
 
-export default function AttractionEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = attractionUtils.getById(id);
-
-    const onSubmit = async (attraction) => {
-        const updatedAttraction = attractionUtils.update(attraction);
-        console.log("updatedAttraction: " + JSON.stringify(updatedAttraction));
-        navigate("/attractions");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Attraction</h1>
-                <AttractionForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.attraction}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function AttractionEditPage() {}
killedBy: AttractionEditPage tests renders without crashing
statusReason: Error: AttractionEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Attractions/AttractionEditPage.js:16:44
 
     const response = attractionUtils.getById(id);
 
-    const onSubmit = async (attraction) => {
-        const updatedAttraction = attractionUtils.update(attraction);
-        console.log("updatedAttraction: " + JSON.stringify(updatedAttraction));
-        navigate("/attractions");
-    }  
+    const onSubmit = async (attraction) => {}  
 
     return (
killedBy: AttractionEditPage tests redirects to /attractions on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
